fishes = [
    {
        'тип': 'карась',
        'имя': 'Жужик',
        'интеллект': 31,
        'ест': ["хлеб", 'белый червь', 'яблоко', "розовый червь"]
    },
    {
        'тип': 'щука',
        'имя': 'Бульба',
        'интеллект': 81,
        'ест': ['розовый червь', 'золото']
    },
    {
        'тип': 'окунь',
        'имя': 'Тэлэпайко',
        'интеллект': 65,
        'ест': ['белый червь', 'крабовые палочки']
    },
    {
        'тип': 'карась',
        'имя': 'Семён',
        'интеллект': 24,
        'ест': ["хлеб", 'белый червь', 'яблоко']
    },
    {
        'тип': 'окунь',
        'имя': 'Пират',
        'интеллект': 68,
        'ест': ["хлеб", 'белый червь', 'яблоко']
    },
    {
        'тип': 'карась',
        'имя': 'Барась',
        'интеллект': 18,
        'ест': ["хлеб", "Мивина"]
    },
    {
        'тип': 'щука',
        'имя': 'Индеец',
        'интеллект': 79,
        'ест': ["розовый червь"]
    },
    {
        'тип': 'карась',
        'имя': 'Птиц',
        'интеллект': 30,
        'ест': ["белый червь", "хлеб", "Мивина"]
    },
    {
        'тип': 'окунь',
        'имя': 'Гуччи',
        'интеллект': 52,
        'ест': ["Мивина", "крабовые палочки"]
    },
]

"""
eat_fish_info = {
    'хлеб': {
        'names': [],
        'counts': {
            'карась': 2,
            'щука': 1
        }
    },
    ...
}
"""

eat_fish_info = {}

for fish in fishes:
    fish_type = fish['тип']

    for eat in fish['ест']:
        if eat not in eat_fish_info:
            eat_fish_info[eat] = {'names': [], 'counts': {}}

        # разбираемся с именами
        eat_fish_info[eat]['names'].append(fish['имя'])
        
        # разбираемся с количествами по типам
        if fish_type not in eat_fish_info[eat]['counts']:
            eat_fish_info[eat]['counts'][fish_type] = 0
        eat_fish_info[eat]['counts'][fish_type] += 1


for eat, info in eat_fish_info.items():
    print(eat, info)
